{
    "hof": [
        {
            "group":"CLIChat",
            "description": "Miguel Aenlle, Jenny Shaughnessy and Zia Lu implemented a command line version of Discord. They created a distributed networking system that allows users to authenticate, connect with each other and create group chats while utilizing a database to store user data. This project demonstrates a deep understanding of concurrency concepts as they handled complex network-based user actions flawlessly, allowing a very smooth user experience. The codebase design is also highly professional, with clear separation of concerns between different program functionalities.",
            "github": "https://github.com/jshaughnessy24/project_cs128h",
            "live": ""
        },
        {
            "group":"PDFer",
            "description": "Fasih Javed, Mathew Randal and Amey Gupta created a lightweight PDF viewer with a built-in notetaking feature. The program GUI allows users to open and view PDF files, and at the same time take notes into a text file in a dual window. They were able to create a complex event-driven system in the form of the user interface (fully written in Rust), making great use of concurrency techniques taught in the class. The team also displayed creativity in how they hooked the PDF handling code into the GUI.",
            "github": "https://github.com/mrandal/PDFer",
            "live": ""
        },
        {
            "group":"spotify-cli",
            "description": "Anirudh Konidala, Canchen Li and Surya Bhamidi made a command line interface (CLI) tool to control your Spotify account. Why? Because CLIs are cool. Their tool allows you to check on currently current songs as well as those in the queue, manage your playlists by querying, creating and deleting playlists, and even following and unfollowing artists. Not only is it released on Homebrew, it is also open source and licensed under the MIT License. Now you can queue songs blazingly fast!",
            "github": "https://github.com/kidskoding/spotify-cli",
            "live": ""
        },
        {
            "group":"Rusticular Torsion",
            "description": "Justin Dyser and Lucas Sanson made an initiative tracker for the tabletop role-playing game Dungeons and Dragons, building the GUI using Slint. In DnD, initiative determines the turn order of battle, and their tool can be used by dungeon masters and players alike. Their interface is connected with a database that automatically fetches monster stats and also includes dice roller features for both general dice rolling and rolling for initiative. Remember to use this tool the next time you find yourself in a dark, dank dungeon...",
            "github": "https://github.com/Lsanson1987/Rusticular-Torsion",
            "live": ""
        }
    ]


}
